app/controllers/school_classes_controller.rb

    def index
        @School_classes = SchoolClass.all
---
SELECT "school_classes".* FROM "school_classes"